davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
#include "display_service.h"

#include <Arduino.h>
#include <bb_epaper.h>
#include <string.h>
#include <Wire.h>
#include "structs.h"
/* OD-PORT: two panel IC values this file compares against are missing from
 * shared/protocol/ -- they were added to Firmware's VENDORED copy of the wire contract
 * and never propagated to canonical. See protocol_pending.h; it is a debt with a
 * documented removal sequence, not a second home for wire constants. */
#include "protocol_pending.h"
#include "od_log.h"
#include "buzzer_control.h"
#include "sensor_sht40.h"
#include "sensor_bq27220.h"
#include "communication.h"
#include "encryption.h"
#include "boot_screen.h"
#include "link_owner.h"
#include "session_guard.h"
#include "touch_input.h"
#include "uzlib.h"
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
#include "display_fastepd.h"
#endif

// On ESP32-WiFi BUILDS, route this file's streaming-inflate calls to the ROM `tinfl`
// engine (src/od_inflate_tinfl.*) instead of the uzlib bit-serial inflater. uzlib
// (lib/uzlib) is left completely untouched — it is simply not called here, so the
// linker drops it. The od_zlib_stream_* call sites below are unchanged; the macros
// rebind them at compile time. od_zlib_status_t / OD_ZLIB_STATUS_* stay shared
// (from uzlib.h).
//
// This remap is UNCONDITIONAL within such a build — it is not gated per transport, so
// it rebinds EVERY compressed path in this file: direct-write (0x70/0x71), partial
// region (0x76), and PIPE_WRITE (0x80-0x82). PIPE_WRITE is BLE-only, so BLE transfers
// decode through tinfl here too. The WiFi keying of OPENDISPLAY_USE_TINFL selects
// which builds opt in (the LAN wire is what makes software inflate the bottleneck and
// justifies tinfl's ~11 KB of DRAM tables, and that flag is now set only on PSRAM
// envs, so a part without the DRAM budget never opts in); it does NOT restrict the
// engine to LAN traffic. See od_inflate_tinfl.h for the full rationale and RAM cost.
#include "od_inflate_tinfl.h"
#if OPENDISPLAY_USE_TINFL
#define od_zlib_stream_reset  od_inflate_tinfl_reset
#define od_zlib_stream_push   od_inflate_tinfl_push
#define od_zlib_stream_poll   od_inflate_tinfl_poll
#define od_zlib_stream_error  od_inflate_tinfl_error
#endif

#ifdef TARGET_NRF
extern "C" {
#include "nrf_soc.h"
}
#include "nrf.h"
#endif

#ifdef TARGET_ESP32
#include "wifi_service.h"
#include <SPI.h>
#endif

#include "ble_transport.h"
#include "command_queue.h"

extern BBEPDISP bbep;
extern struct GlobalConfig globalConfig;
extern uint8_t msd_payload[16];
extern uint8_t dynamicreturndata[11];
extern uint8_t rebootFlag;
extern uint8_t activeLedInstance;
extern bool connectionRequested;
extern uint8_t mloopcounter;
extern bool displayPowerState;
// EPD panel power state machine — variables DEFINED in main.h TU; enum +
// EPD_KEEPALIVE_MAX_S live in display_service.h.
extern volatile uint8_t pwrmgmState;
extern uint32_t pwrmgmOffDeadlineMs;
extern volatile uint8_t pwrmgmLock;
extern uint32_t directWriteStartTime;
extern uint32_t directWriteCompressedReceived;
extern uint8_t directWriteRefreshMode;
extern uint32_t directWriteTotalBytes;
extern uint16_t directWriteHeight;
extern uint16_t directWriteWidth;
extern uint32_t directWriteDecompressedTotal;
extern uint32_t directWriteBytesWritten;
extern bool directWritePlane2;
extern bool directWriteBitplanes;
extern bool directWriteCompressed;
extern bool directWriteActive;
extern uint8_t decompressionChunk[OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE];
volatile bool epdRefreshInProgress = false;

// The ONE place the refresh bracket is closed, on every path.
//
// Both bracket sites used to assign epdRefreshInProgress = false inline. Routing
// them through a helper is what makes the R4 refresh exclusion implementable: a
// loop-side edge detector cannot see this transition, because loop() does not run
// for the refresh's whole duration -- both edges happen inside the blocking
// handler while wall-clock time passes. The activity clock has to be re-stamped AT
// the transition or a naive millis()-lastStamp accrues the entire refresh and drops
// an actively engaged client the instant loop() resumes.
//
// Re-stamping can only ever DELAY a drop, never cause a spurious one, which is why
// it is safe to apply unconditionally here. A future third refresh path gets the
// exclusion by calling this instead of remembering a second statement.
void endRefresh(void) {
    epdRefreshInProgress = false;
    linkStampRefreshEnd();
}

extern uint32_t displayed_etag;

// 0x76 partial-write error codes come from the canonical opendisplay_protocol.h;
// use OD_ERR_PARTIAL_* directly at the call sites rather than shadowing them here
// (the OD_ERR_PIPE_START_* family reuses the same byte values with DIFFERENT
// meanings, so a local copy is a drift/mix-up hazard). For reference:
//   OD_ERR_PARTIAL_ETAG_MISMATCH  0x01   old_etag != displayed etag
//   OD_ERR_PARTIAL_RECT_OOB       0x03   rectangle out of panel bounds
//   OD_ERR_PARTIAL_RECT_ALIGN     0x04   x / width not a multiple of 8
//   OD_ERR_PARTIAL_FLAGS          0x05   bad / unsupported flags
//   OD_ERR_PARTIAL_STREAM         0x06   stream / length error
//   OD_ERR_PARTIAL_UNSUPPORTED    0x07   partial write unsupported (e.g. not 1bpp)

// TODO(protocol): the canonical header defines no partial-write flag constant;
// the 0x76 path reuses the bit0=compressed convention. Add an OD_PARTIAL_FLAG_*
// (or reuse a shared flag) upstream in opendisplay-protocol, then drop this local.
static const uint8_t PARTIAL_FLAG_COMPRESSED = 0x01u;
static const uint8_t PARTIAL_ALLOWED_FLAGS = PARTIAL_FLAG_COMPRESSED;

struct PartialStreamContext {
    bool active;
    bool compressed;
    uint8_t flags;
    uint32_t new_etag;
    uint16_t x;
    uint16_t y;
    uint16_t width;
    uint16_t height;
    uint32_t expected_stream_size;
    uint32_t plane_size;
    uint32_t bytes_received;
    uint32_t bytes_written;
    uint8_t current_plane;
    uint32_t start_time;
};

void pwrmgm(bool onoff);
void bbepInitIO(BBEPDISP *pBBEP, uint8_t u8DC, uint8_t u8RST, uint8_t u8BUSY, uint8_t u8CS, uint8_t u8MOSI, uint8_t u8SCK, uint32_t u32Speed);
void bbepWakeUp(BBEPDISP *pBBEP);
void bbepSendCMDSequence(BBEPDISP *pBBEP, const uint8_t *pSeq);
void bbepRefresh(BBEPDISP *pBBEP, int iMode);
void bbepSleep(BBEPDISP *pBBEP, int iMode);
void bbepSetAddrWindow(BBEPDISP *pBBEP, int x, int y, int cx, int cy);
void bbepStartWrite(BBEPDISP *pBBEP, int iPlane);
void bbepWriteData(BBEPDISP *pBBEP, uint8_t *pData, int iLen);
void bbepFill(BBEPDISP *pBBEP, unsigned char ucColor, int iPlane);
void bbepWriteCmd(BBEPDISP *pBBEP, uint8_t cmd);
void bbepCMD2(BBEPDISP *pBBEP, uint8_t cmd1, uint8_t cmd2);
void bbepWaitBusy(BBEPDISP *pBBEP);
/* NOT an upstream bb_epaper function -- provided by panel/od_bbep_idf_io.inl, this target's own
 * IO backend. Upstream has no teardown at all, which is what made every re-init a workaround:
 * the bus was never released, so a second spi_bus_initialize() could only fail. See
 * docs/BBEPAPER_IO_BACKENDS.md. */
void bbepDeInitIO(void);
bool bbepIsBusy(BBEPDISP *pBBEP);
#ifdef BBEP_T133A01
void bbepSetCS2(BBEPDISP *pBBEP, uint8_t cs);
void bbepWriteCmdData(BBEPDISP *pBBEP, uint8_t cmd, const uint8_t *pData, int iLen);
void bbepStartDataStream(BBEPDISP *pBBEP, uint8_t cmd);
void bbepWriteDataStreamByte(BBEPDISP *pBBEP, uint8_t data);
void bbepEndDataStream(BBEPDISP *pBBEP);
#endif
void flashLed(uint8_t color, uint8_t brightness);
bool waitforrefresh(int timeout);

