davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
static bool refreshBootScreenFull() {
    if (!writeBootScreenWithQr()) {
        od_log_warn("Boot screen render failed");
        return false;
    }
    od_log_info("EPD refresh: FULL (boot)");
    touchSuspendForEpdRefresh();
    bbepRefresh(&bbep, REFRESH_FULL);
    return waitforrefresh(60);
}

static void cleanup_partial_write_state(void);
static bool panel_skips_bbep_set_addr_window(void);
static void partial_set_addr_window(BBEPDISP *pBBEP, int x, int y, int cx, int cy);
static bool partial_consume_bytes(uint8_t* data, uint32_t len);
static void partial_prepare_panel_ram(void);
static bool partial_write_to_panel(int refreshMode);
static bool partial_write_stream_bytes(uint8_t* data, uint32_t len);
static bool zlib_stream_to_direct_write(const uint8_t* data, uint32_t len, bool final);
static bool zlib_stream_to_partial_write(const uint8_t* data, uint32_t len, bool final);
static uint32_t calc_controller_plane_bytes(uint16_t width, uint16_t height);
static uint32_t parse_be_u32(const uint8_t* data);
static void send_direct_write_nack(uint8_t opcode, uint8_t error, bool cleanupState);
static PartialStreamContext partialCtx = {};

// Direct-write session-setup helpers (shared by legacy 0x70 START and PIPE 0x80 START)
// and the shared END/refresh tail (shared by legacy 0x72 END, PIPE 0x82 END, and
// both auto-complete paths). Declared here; defined below near the direct-write handlers.
static void directWriteComputeGeometry(bool compressed);
static void directWriteActivatePanel(void);
static void directWriteFinishAndRefresh(uint8_t* data, uint16_t len, uint8_t endOpcode);
static bool imageWriteFramesMayStillArrive(void);

// serviceBleTx() comes from command_queue.h. The response ring's only drainer is
// the loop task, which is the same task running these handlers -- so anything
// queued here stays queued until we return. Call it before any multi-second
// blocking work (see the refresh tail).

// PIPE_WRITE (0x0080-0x0082) sliding-window receive state + reorder queue. Declared
// early so the quiet-logging predicates below can consult pipeState.active. The
// reorder array is a file static (not in the struct) so both targets pay it once.
static PipeWriteState pipeState = {};
static PipeReorderSlot pipeReorder[PIPE_REORDER_SLOTS];

// Shared by both watchdogs below. Measured from START, not from the last accepted
// frame, so it bounds the whole transfer rather than a stall -- see the residual
// note in docs/PLAN_WORK_GATE_TRANSFER_TERMS_2026-07-29.md before changing that.
static const uint32_t TRANSFER_WATCHDOG_MS = 900000UL;   // 15 min (upload + refresh window)

void checkTransferTimeouts(void) {
    // No "&& startTime > 0" sentinel on either watchdog: each START sets the active
    // flag and its millis() stamp in straight-line setup with no return between, so
    // the flag already implies a valid stamp. Zero is a legitimate stamp -- treating
    // it as "unset" would permanently disable the watchdog for a transfer that began
    // in the ~1 ms window where millis() wraps through zero. Of order one in 10^9
    // transfers, so this is removing a special case from the invariant rather than
    // fixing a live risk.
    // Both branches route through the ONE teardown routine (CONNECTION_POLICY R6's
    // teardown extended to a non-disconnect trigger). This function is cited in the
    // freeze-hardening plan as the very reason a shared routine is needed -- it is
    // where a watchdog once tore down a panel while leaving its pipe session live --
    // so exempting it would have argued for the routine while leaving the original
    // drift source untouched.
    //
    // Three deliberate behaviour changes come with it: crypto is now cleared (it
    // used to survive), the link is now dropped, and teardown is no longer selective
    // (each branch used to clean one transfer half). Dropping follows from clearing:
    // a retained link whose session is gone draws RESP_AUTH_REQUIRED with no event
    // to explain it. The client must restart the transfer either way, since the
    // transfer state is gone regardless.
    //
    // dropLink=true dispatches on the OWNER'S transport inside the abort -- this
    // watchdog is origin-agnostic (both tests below read transfer state, not
    // origin), so a timed-out LAN transfer must lose its socket, not some unrelated
    // BLE handle.
    // Drop the link only when the slot's owner is the transport that OWNS THIS
    // TRANSFER. Under the claim CAS the two agree in every sequence I can construct
    // -- a session that does not hold the slot is refused rather than admitted, and
    // every abort clears transfer state BEFORE releasing -- so this comparison is
    // defensive rather than load-bearing. It is kept because the cost is one test
    // and the failure it guards against (dropping an innocent client's link over
    // another transport's stuck transfer) is invisible from the log.
    const LinkId owner = linkOwnerId();
    const bool lanOwnsTransfer = (transferSessionOrigin() != 0);   // != ORIGIN_BLE
    const bool dropOwnersLink =
        (lanOwnsTransfer && owner.who == OWNER_LAN) ||
        (!lanOwnsTransfer && owner.who == OWNER_BLE);

    if (directWriteActive) {
        uint32_t directWriteDuration = millis() - directWriteStartTime;
        if (directWriteDuration > TRANSFER_WATCHDOG_MS) {
            od_log_error("ERROR: Direct write timeout (%u ms) - aborting session", (unsigned)directWriteDuration);
            abortToKnownState("direct-write transfer watchdog", dropOwnersLink, owner);
            return;   // the abort cleared every branch below
        }
    }

    if (partialCtx.active &&
        (millis() - partialCtx.start_time) > TRANSFER_WATCHDOG_MS) {
        od_log_error("ERROR: Partial write timeout - aborting session");
        abortToKnownState("partial transfer watchdog", dropOwnersLink, owner);
        return;
    }

    // Postcondition over both branches above: a live, non-errored pipe session
    // always has a hardware half. 77c2226 proved that and closed the one path that
    // broke it; this asserts it at runtime rather than resting on the proof, and
    // heals it rather than merely reporting it. Placed last deliberately -- run
    // first it would only inspect entry state, and could leave an inconsistency
    // either watchdog had just created until the next pass.
    //
    // What a recurrence costs: the 0x0081 handler gates on pipeState alone, so
    // frames are accepted into torn-down state, and with the byte counters zeroed by
    // cleanup the uncompressed auto-complete reads 0 >= 0 and drives a full refresh
    // at an unpowered panel.
    //
    // Deliberately NOT a workInFlight term. A transfer whose transport is gone
    // cannot progress, so holding the loop awake for it burns power for work that
    // will never happen -- on nRF a delay(1) gate is below the tickless threshold
    // and spins rather than sleeping. Remove the state; do not idle on it.
    if (pipeState.active && !pipeState.error && !directWriteActive && !partialCtx.active) {
        od_log_error("ERROR: orphaned pipe session (no hardware half) - resetting");
        resetPipeWriteState();
    }
}

// Disconnect hook: a partial session (0x76 or pipe-partial) powers the panel via
// partial_prepare_panel_ram but never sets directWriteActive, so the disconnect
// handlers' cleanupDirectWriteState gate misses it and the panel would stay
// powered until the 15-min watchdog. cleanup_partial_write_state is file-static;
// this wrapper gives the BLE callbacks a safe no-op-when-idle entry point.
void cleanupPartialWriteOnDisconnect(void) {
    if (partialCtx.active) cleanup_partial_write_state();
}

#define AXP2101_SLAVE_ADDRESS 0x34
#define AXP2101_REG_POWER_STATUS 0x00
#define AXP2101_REG_DC_ONOFF_DVM_CTRL 0x80
#define AXP2101_REG_LDO_ONOFF_CTRL0 0x90
#define AXP2101_REG_DC_VOL0_CTRL 0x82
#define AXP2101_REG_LDO_VOL2_CTRL 0x94
#define AXP2101_REG_LDO_VOL3_CTRL 0x95
#define AXP2101_REG_POWER_WAKEUP_CTL 0x26
#define AXP2101_REG_ADC_CHANNEL_CTRL 0x30
#define AXP2101_REG_ADC_DATA_BAT_VOL_H 0x34
#define AXP2101_REG_ADC_DATA_VBUS_VOL_H 0x36
#define AXP2101_REG_ADC_DATA_SYS_VOL_H 0x38
#define AXP2101_REG_BAT_PERCENT_DATA 0xA4
#define AXP2101_REG_PWRON_STATUS 0x20
#define AXP2101_REG_IRQ_ENABLE1 0x40
#define AXP2101_REG_IRQ_ENABLE2 0x41
#define AXP2101_REG_IRQ_ENABLE3 0x42
#define AXP2101_REG_IRQ_ENABLE4 0x43
#define AXP2101_REG_IRQ_STATUS1 0x44
#define AXP2101_REG_IRQ_STATUS2 0x45
#define AXP2101_REG_IRQ_STATUS3 0x46
#define AXP2101_REG_IRQ_STATUS4 0x47
#define AXP2101_REG_LDO_ONOFF_CTRL1 0x91
#define FONT_BASE_WIDTH 8
#define FONT_BASE_HEIGHT 8
#define FONT_SMALL_THRESHOLD 264

