davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
bool openDisplayI2cBusConfigured(void) {
    for (uint8_t i = 0; i < globalConfig.data_bus_count; i++) {
        if (i2cDataBusValid(i)) {
            return true;
        }
    }
    return false;
}

void invalidateOpenDisplayWire(void) {
#ifdef TARGET_ESP32
    if (s_wire_open_display_ready) {
        Wire.end();
    }
    s_wire_open_display_ready = false;
#endif
}

bool initOrRestoreWireForBus(uint8_t bus_id) {
#ifdef TARGET_ESP32
    if (bus_id == 0xFF) {
        bus_id = 0;
    }
    if (!i2cDataBusValid(bus_id)) {
        return false;
    }
    const struct DataBus& bus = globalConfig.data_buses[bus_id];
    uint32_t hz = bus.bus_speed_hz ? bus.bus_speed_hz : 100000u;
    int sda = (int)bus.pin_2;
    int scl = (int)bus.pin_1;
    if (s_wire_open_display_ready && s_wire_sda_pin == sda && s_wire_scl_pin == scl) {
        return true;
    }
    if (s_wire_open_display_ready) {
        Wire.end();
        s_wire_open_display_ready = false;
    }
    if (!wireBeginForOpenDisplay(sda, scl, hz)) {
        s_wire_open_display_ready = false;
        return false;
    }
    return true;
#else
    (void)bus_id;
    initOrRestoreWireForOpenDisplay();
    return true;
#endif
}

void initOrRestoreWireForOpenDisplay(void) {
#ifdef TARGET_ESP32
    if (globalConfig.data_bus_count > 0 && i2cDataBusValid(0)) {
        (void)initOrRestoreWireForBus(0);
        return;
    }
    if (!s_wire_open_display_ready) {
        if (Wire.begin()) {
            s_wire_open_display_ready = true;
        }
    }
#else
    if (!openDisplayI2cBusConfigured()) {
        return;
    }
    if (i2cDataBusValid(0)) {
        const struct DataBus& bus = globalConfig.data_buses[0];
        pinMode(bus.pin_1, (bus.pullups & 0x01) ? INPUT_PULLUP : INPUT);
        pinMode(bus.pin_2, (bus.pullups & 0x02) ? INPUT_PULLUP : INPUT);
    }
    Wire.begin();
    if (i2cDataBusValid(0) && globalConfig.data_buses[0].bus_speed_hz > 0) {
        Wire.setClock(globalConfig.data_buses[0].bus_speed_hz);
    }
#endif
}

void initDataBuses(){
    od_log_info("=== Initializing Data Buses ===");
    if(globalConfig.data_bus_count == 0){
        od_log_info("No data buses configured");
        return;
    }
    for(uint8_t i = 0; i < globalConfig.data_bus_count; i++){
        struct DataBus* bus = &globalConfig.data_buses[i];
        if(bus->bus_type == 0x01){ // I2C bus
            od_log_info("Initializing I2C bus %u (instance %u)", i, bus->instance_number);
            if(bus->pin_1 == 0xFF || bus->pin_2 == 0xFF){
                od_log_error("ERROR: Invalid I2C pins for bus %u (SCL=%u, SDA=%u)", i, bus->pin_1, bus->pin_2);
                continue;
            }
            uint32_t busSpeed = (bus->bus_speed_hz > 0) ? bus->bus_speed_hz : 100000;
            if(i == 0){
                #ifdef TARGET_ESP32
                initOrRestoreWireForOpenDisplay();
                #endif
                #ifdef TARGET_NRF
                pinMode(bus->pin_1, INPUT);
                pinMode(bus->pin_2, INPUT);
                if(bus->pullups & 0x01){
                    pinMode(bus->pin_1, INPUT_PULLUP);
                }
                if(bus->pullups & 0x02){
                    pinMode(bus->pin_2, INPUT_PULLUP);
                }
                Wire.begin(); // Uses default I2C pins
                Wire.setClock(busSpeed);
                od_log_info("NOTE: nRF52840 using default I2C pins (config pins: SCL=%u, SDA=%u)", bus->pin_1, bus->pin_2);
                #endif
                od_log_info("I2C bus %u initialized: SCL=pin%u, SDA=pin%u, Speed=%uHz", i, bus->pin_1, bus->pin_2, (unsigned)busSpeed);
            } else {
                od_log_info("I2C bus %u configured (init on demand): SCL=pin%u, SDA=pin%u, Speed=%uHz",
                    i, bus->pin_1, bus->pin_2, (unsigned)busSpeed);
            }
        }
        else if(bus->bus_type == 0x02){
            od_log_info("SPI bus %u detected (not yet implemented)", i);
            od_log_info("  Instance: %u", bus->instance_number);
        }
        else{
            od_log_warn("WARNING: Unknown bus type 0x%02X for bus %u", bus->bus_type, i);
        }
    }
    od_log_info("=== Data Bus Initialization Complete ===");
}

void initio(){
    od_log_info("[initio] >> LEDs"); od_log_flush();
    if(globalConfig.led_count > 0){
        for (uint8_t i = 0; i < globalConfig.led_count; i++) {
            struct LedConfig* led = &globalConfig.leds[i];
            bool invertRed = (led->led_flags & 0x01) != 0;
            bool invertGreen = (led->led_flags & 0x02) != 0;
            bool invertBlue = (led->led_flags & 0x04) != 0;
            bool invertLed4 = (led->led_flags & 0x08) != 0;
                if (led->led_1_r != 0xFF) {
                    pinMode(led->led_1_r, OUTPUT);
                    digitalWrite(led->led_1_r, invertRed ? HIGH : LOW);
                }
                if (led->led_2_g != 0xFF) {
                    pinMode(led->led_2_g, OUTPUT);
                    digitalWrite(led->led_2_g, invertGreen ? HIGH : LOW);
                }
                if (led->led_3_b != 0xFF) {
                    pinMode(led->led_3_b, OUTPUT);
                    digitalWrite(led->led_3_b, invertBlue ? HIGH : LOW);
                }
                if (led->led_4 != 0xFF) {
                    pinMode(led->led_4, OUTPUT);
                    digitalWrite(led->led_4, invertLed4 ? HIGH : LOW);
                }
        }
        for (uint8_t i = 0; i < globalConfig.led_count; i++) {
            if (globalConfig.leds[i].led_type == 0) {
                activeLedInstance = i;
#ifdef TARGET_NRF
                if (nrfVbusPresent())
#endif
                {
                    flashLed(0xE0, 15);
                    flashLed(0x1C, 15);
                    flashLed(0x03, 15);
                    flashLed(0xFF, 15);
                }
            }
        }
    }
    od_log_info("[initio] >> initPassiveBuzzers"); od_log_flush();
    initPassiveBuzzers();
    od_log_info("[initio] >> pwr_pin"); od_log_flush();
    if(globalConfig.system_config.pwr_pin != 0xFF){
    pinMode(globalConfig.system_config.pwr_pin, OUTPUT);
    digitalWrite(globalConfig.system_config.pwr_pin, LOW);
    }
    else{
        od_log_warn("Power pin not set");
    }
    od_log_info("[initio] >> initDataBuses"); od_log_flush();
    initDataBuses();
    od_log_info("[initio] >> initSensors"); od_log_flush();
    initSensors();
    od_log_info("[initio] << done"); od_log_flush();
}

void scanI2CDevices(){
    od_log_info("=== Scanning I2C Bus for Devices ===");
    initOrRestoreWireForOpenDisplay();
    uint8_t deviceCount = 0;
    uint8_t foundDevices[128];
    for(uint8_t address = 0x08; address < 0x78; address++){
        Wire.beginTransmission(address);
        uint8_t error = Wire.endTransmission();
        if(error == 0){
            foundDevices[deviceCount] = address;
            deviceCount++;
            od_log_debug("I2C device found at address 0x%02X (%u)", address, address);
        }
        else if(error == 4){
            od_log_error("ERROR: Unknown error at address 0x%02X", address);
        }
    }
    if(deviceCount == 0){
        od_log_warn("No I2C devices found on bus");
    } else {
        od_log_debug("Found %u I2C device(s)", deviceCount);
        od_log_debug("Device addresses: ");
        char addrList[700];
        int pos = snprintf(addrList, sizeof(addrList), "%s", "");
        if (pos < 0) {
            pos = 0;
            addrList[0] = '\0';
        }
        for(uint8_t i = 0; i < deviceCount && pos < (int)sizeof(addrList); i++){
            int n = snprintf(addrList + pos, sizeof(addrList) - pos, i > 0 ? ", 0x%02X" : "0x%02X", foundDevices[i]);
            if (n < 0) {
                break;
            }
            pos += n;
        }
        od_log_debug("%s", addrList);
    }
    od_log_info("=== I2C Scan Complete ===");
}

void initSensors(){
    od_log_info("=== Initializing Sensors ===");
    if(globalConfig.sensor_count == 0){
        od_log_warn("No sensors configured");
        return;
    }
    for(uint8_t i = 0; i < globalConfig.sensor_count; i++){
        struct SensorData* sensor = &globalConfig.sensors[i];
        od_log_debug("Initializing sensor %u (instance %u)", i, sensor->instance_number);
        od_log_debug("  Type: 0x%04X", sensor->sensor_type);
        od_log_debug("  Bus ID: %u", sensor->bus_id);
        if(sensor->sensor_type == OD_SENSOR_TYPE_AXP2101){
            od_log_debug("  Detected AXP2101 PMIC sensor");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_TEMPERATURE){
            od_log_debug("  Temperature sensor (initialization not implemented)");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_HUMIDITY){
            od_log_debug("  Humidity sensor (initialization not implemented)");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_SHT40){
            od_log_debug("  SHT40 (I2C + MSD slot)");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_BQ27220){
            od_log_debug("  BQ27220 fuel gauge (MSD voltage + optional dynamic SOC/status bytes)");
        }
        else{
            od_log_warn("  Unknown sensor type 0x%04X", sensor->sensor_type);
        }
    }
    initSht40Sensors();
    initBq27220Sensors();
    od_log_info("=== Sensor Initialization Complete ===");
}

void initAXP2101(uint8_t busId){
    pinMode(21, OUTPUT);
    digitalWrite(21, LOW);
    delay(100);
    digitalWrite(21, HIGH);
    od_log_info("=== Initializing AXP2101 PMIC ===");
    if(busId >= globalConfig.data_bus_count){
        od_log_error("ERROR: Invalid bus ID %u (only %u buses configured)", busId, globalConfig.data_bus_count);
        return;
    }
    struct DataBus* bus = &globalConfig.data_buses[busId];
    if(bus->bus_type != 0x01){
        od_log_error("ERROR: Bus %u is not an I2C bus", busId);
        return;
    }
    if(!initOrRestoreWireForBus(busId)){
        od_log_error("ERROR: Failed to (re)init I2C bus %u for AXP2101", busId);
        return;
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    uint8_t error = Wire.endTransmission();
    if(error != 0){
        od_log_error("ERROR: AXP2101 not found at address 0x%02X (error: %u)", AXP2101_SLAVE_ADDRESS, error);
        return;
    }
    od_log_debug("AXP2101 detected at address 0x%02X", AXP2101_SLAVE_ADDRESS);
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_POWER_STATUS);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            uint8_t status = Wire.read();
            od_log_debug("Power status: 0x%02X", status);
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_DC_VOL0_CTRL);
    Wire.write(0x12);
    error = Wire.endTransmission();
    if(error == 0){
        od_log_debug("DCDC1 voltage set to 3.3V");
    } else {
        od_log_error("ERROR: Failed to set DCDC1 voltage");
    }
    delay(10);
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_DC_ONOFF_DVM_CTRL);
    error = Wire.endTransmission();
    uint8_t dcEnable = 0x00;
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            dcEnable = Wire.read();
        }
    }
    dcEnable |= 0x01;
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_DC_ONOFF_DVM_CTRL);
    Wire.write(dcEnable);
    error = Wire.endTransmission();
    if(error == 0){
        od_log_debug("DCDC1 enabled (3.3V)");
    } else {
        od_log_error("ERROR: Failed to enable DCDC1");
    }
    delay(10);
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_LDO_ONOFF_CTRL0);
    error = Wire.endTransmission();
    uint8_t aldoEnable = 0x00;
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            aldoEnable = Wire.read();
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_LDO_VOL2_CTRL);
    error = Wire.endTransmission();
    uint8_t aldo3VolReg = 0x00;
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            aldo3VolReg = Wire.read();
        }
    }
    aldo3VolReg = (aldo3VolReg & 0xE0) | 0x1C;
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_LDO_VOL2_CTRL);
    Wire.write(aldo3VolReg);
    error = Wire.endTransmission();
    if(error == 0){
        od_log_debug("ALDO3 voltage set to 3.3V");
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_LDO_VOL3_CTRL);
    error = Wire.endTransmission();
    uint8_t aldo4VolReg = 0x00;
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            aldo4VolReg = Wire.read();
        }
    }
    aldo4VolReg = (aldo4VolReg & 0xE0) | 0x1C;
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_LDO_VOL3_CTRL);
    Wire.write(aldo4VolReg);
    error = Wire.endTransmission();
    if(error == 0){
        od_log_debug("ALDO4 voltage set to 3.3V");
    }
    aldoEnable |= 0x0C;
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_LDO_ONOFF_CTRL0);
    Wire.write(aldoEnable);
    error = Wire.endTransmission();
    if(error == 0){
        od_log_debug("ALDO3 and ALDO4 enabled (3.3V)");
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_POWER_WAKEUP_CTL);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            uint8_t wakeupCtl = Wire.read();
            od_log_debug("Wakeup control: 0x%02X", wakeupCtl);
            if(wakeupCtl & 0x01){
                od_log_debug("Wakeup already enabled");
            } else {
                Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
                Wire.write(AXP2101_REG_POWER_WAKEUP_CTL);
                Wire.write(wakeupCtl | 0x01);
                error = Wire.endTransmission();
                if(error == 0){
                    od_log_debug("Wakeup enabled");
                }
            }
        }
    }
    od_log_info("=== AXP2101 PMIC Initialization Complete ===");
}

void readAXP2101Data(){
    od_log_info("=== Reading AXP2101 PMIC Data ===");
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    uint8_t error = Wire.endTransmission();
    if(error != 0){
        od_log_error("ERROR: AXP2101 not found at address 0x%02X", AXP2101_SLAVE_ADDRESS);
        return;
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_ADC_CHANNEL_CTRL);
    Wire.write(0xFF);
    error = Wire.endTransmission();
    delay(10);
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_POWER_STATUS);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)2);
        if(Wire.available() >= 2){
            uint8_t status1 = Wire.read();
            uint8_t status2 = Wire.read();
            od_log_debug("Power Status 1: 0x%02X", status1);
            od_log_debug("Power Status 2: 0x%02X", status2);
            bool batteryPresent = (status1 & 0x20) != 0;
            bool charging = (status1 & 0x04) != 0;
            bool vbusPresent = (status1 & 0x08) != 0;
            od_log_debug("Battery Present: %s", batteryPresent ? "Yes" : "No");
            od_log_debug("Charging: %s", charging ? "Yes" : "No");
            od_log_debug("VBUS Present: %s", vbusPresent ? "Yes" : "No");
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_PWRON_STATUS);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            uint8_t pwronStatus = Wire.read();
            od_log_debug("Power On Status: 0x%02X", pwronStatus);
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_ADC_DATA_BAT_VOL_H);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)2);
        if(Wire.available() >= 2){
            uint8_t batVolH = Wire.read();
            uint8_t batVolL = Wire.read();
            uint16_t batVolRaw = ((uint16_t)batVolH << 4) | (batVolL & 0x0F);
            float batVoltage = batVolRaw * 0.5;
            od_log_debug("Battery Voltage: %.1f mV (%.2f V)", batVoltage, batVoltage / 1000.0);
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_ADC_DATA_VBUS_VOL_H);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)2);
        if(Wire.available() >= 2){
            uint8_t vbusVolH = Wire.read();
            uint8_t vbusVolL = Wire.read();
            uint16_t vbusVolRaw = ((uint16_t)vbusVolH << 4) | (vbusVolL & 0x0F);
            float vbusVoltage = vbusVolRaw * 1.7;
            od_log_debug("VBUS Voltage: %.1f mV (%.2f V)", vbusVoltage, vbusVoltage / 1000.0);
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_ADC_DATA_SYS_VOL_H);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)2);
        if(Wire.available() >= 2){
            uint8_t sysVolH = Wire.read();
            uint8_t sysVolL = Wire.read();
            uint16_t sysVolRaw = ((uint16_t)sysVolH << 4) | (sysVolL & 0x0F);
            float sysVoltage = sysVolRaw * 1.4;
            od_log_debug("System Voltage: %.1f mV (%.2f V)", sysVoltage, sysVoltage / 1000.0);
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_BAT_PERCENT_DATA);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            uint8_t batPercent = Wire.read();
            if(batPercent <= 100){
                od_log_debug("Battery Percentage: %u%%", batPercent);
            } else {
                od_log_debug("Battery Percentage: Not available (fuel gauge may be disabled)");
            }
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_DC_ONOFF_DVM_CTRL);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            uint8_t dcEnable = Wire.read();
            od_log_debug("DC Enable Status: 0x%02X", dcEnable);
            od_log_debug("  DCDC1: %s", (dcEnable & 0x01) ? "ON" : "OFF");
            od_log_debug("  DCDC2: %s", (dcEnable & 0x02) ? "ON" : "OFF");
            od_log_debug("  DCDC3: %s", (dcEnable & 0x04) ? "ON" : "OFF");
            od_log_debug("  DCDC4: %s", (dcEnable & 0x08) ? "ON" : "OFF");
            od_log_debug("  DCDC5: %s", (dcEnable & 0x10) ? "ON" : "OFF");
        }
    }
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    Wire.write(AXP2101_REG_LDO_ONOFF_CTRL0);
    error = Wire.endTransmission();
    if(error == 0){
        Wire.requestFrom(AXP2101_SLAVE_ADDRESS, (uint8_t)1);
        if(Wire.available()){
            uint8_t aldoEnable = Wire.read();
            od_log_debug("ALDO Enable Status: 0x%02X", aldoEnable);
            od_log_debug("  ALDO1: %s", (aldoEnable & 0x01) ? "ON" : "OFF");
            od_log_debug("  ALDO2: %s", (aldoEnable & 0x02) ? "ON" : "OFF");
            od_log_debug("  ALDO3: %s", (aldoEnable & 0x04) ? "ON" : "OFF");
            od_log_debug("  ALDO4: %s", (aldoEnable & 0x08) ? "ON" : "OFF");
        }
    }
    od_log_info("=== AXP2101 Data Read Complete ===");
}

