davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
void initDisplay(){
    od_log_info("=== Initializing Display ===");
    if(globalConfig.display_count > 0){
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        pwrmgm(true);
        int bitsPerPixel = getBitsPerPixel();
        od_log_info("Display: FastEPD (panel_ic %u, %ux%u, %d bpp)",
                    globalConfig.displays[0].panel_ic_type,
                    globalConfig.displays[0].pixel_width, globalConfig.displays[0].pixel_height,
                    bitsPerPixel);
        fastepd_epaper_begin();
        if (fastepd_init_failed()) {
            od_log_warn("FastEPD init failed — skipping boot refresh");
            fastepd_mark_hw_deinitialized();
            pwrmgm(false);
            return;
        }
        od_log_info("Height: %u", globalConfig.displays[0].pixel_height);
        od_log_info("Width: %u", globalConfig.displays[0].pixel_width);
        if (! (globalConfig.displays[0].transmission_modes & OD_TRANSMISSION_MODE_CLEAR_ON_BOOT)){
            writeBootScreenWithQr();
            od_log_info("EPD refresh: FULL (boot, FastEPD)");
            touchSuspendForEpdRefresh();
            fastepd_full_update();
            waitforrefresh(60);
            epdSessionForceOff();
            touchResumeAfterEpdRefresh();
        } else {
            epdSessionForceOff();
        }
    } else
#endif
    {
        prepareEpdRailForBoot();
        memset(&bbep, 0, sizeof(BBEPDISP));
        int panelType = mapEpd(globalConfig.displays[0].panel_ic_type);
        bbepSetPanelType(&bbep, panelType);
        int rotation = globalConfig.displays[0].rotation * 90;
#ifdef BBEP_T133A01
        e1004GeometryOk = false;
        if (e1004_panel_used()) {
            rotation = 0;  // host bakes rotation into packed image
            if (globalConfig.displays[0].pixel_width != bbep.native_width ||
                globalConfig.displays[0].pixel_height != bbep.native_height ||
                globalConfig.displays[0].color_scheme != OD_COLOR_SCHEME_BWGBRY_SPLIT) {
                od_log_error("ERROR: E1004 requires a 1200x1600 bwgbry_split (8) display config");
            } else {
                e1004GeometryOk = true;
            }
        }
#endif
        bbepSetRotation(&bbep, rotation);
        od_log_info("Height: %u", globalConfig.displays[0].pixel_height);
        od_log_info("Width: %u", globalConfig.displays[0].pixel_width);
        initBbepPanelSession();
        if (! (globalConfig.displays[0].transmission_modes & OD_TRANSMISSION_MODE_CLEAR_ON_BOOT)){
            bool bootOk = refreshBootScreenFull();
            if (!bootOk && !nrfVbusPresent()) {
                od_log_warn("Boot refresh failed on battery — re-powering panel and retrying");
                touchResumeAfterEpdRefresh();
                pwrmgm(false);
                delay(200);
                prepareEpdRailForBoot();
                initBbepPanelSession();
                bootOk = refreshBootScreenFull();
            }
            if (!bootOk) {
                od_log_warn("Boot screen refresh did not complete");
            }
            // Boot ends PWR_OFF (no keep-alive at boot). pwrmgm(true) in boot set
            // PWR_ACTIVE, so ForceOff sleeps the controller + cuts the rail cleanly.
            epdSessionForceOff();
            touchResumeAfterEpdRefresh();
        } else {
            // CLEAR_ON_BOOT: initBbepPanelSession left the controller awake —
            // ForceOff sleeps it before the rail cut (raw pwrmgm(false) skipped that).
            epdSessionForceOff();
        }
    }
    }
    else{
        od_log_warn("No display found");
    }
}


int getplane() {
    uint8_t colorScheme = globalConfig.displays[0].color_scheme;
    if (colorScheme == OD_COLOR_SCHEME_MONO || colorScheme == OD_COLOR_SCHEME_GRAY16) return PLANE_0;
    if (colorScheme == OD_COLOR_SCHEME_BWR || colorScheme == OD_COLOR_SCHEME_BWY) return PLANE_0;
    if (colorScheme == OD_COLOR_SCHEME_GRAY4) return PLANE_1;
    return PLANE_1;
}

int getBitsPerPixel() {
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (globalConfig.display_count > 0 &&
        globalConfig.displays[0].panel_ic_type == OD_PANEL_IC_ED103TC2_1872X1404_4GRAY) {
        return 4;
    }
#endif
    if (globalConfig.displays[0].color_scheme == OD_COLOR_SCHEME_BWGBRY ||
        globalConfig.displays[0].color_scheme == OD_COLOR_SCHEME_BWGBRY_SPLIT) return 4;
    if (globalConfig.displays[0].color_scheme == OD_COLOR_SCHEME_GRAY16) return 4;
    if (globalConfig.displays[0].color_scheme == OD_COLOR_SCHEME_BWRY) return 2;
    if (globalConfig.displays[0].color_scheme == OD_COLOR_SCHEME_GRAY4) return 2;
    return 1;
}

static float readBatteryVoltageUncached() {
    if (bq27220IsConfigured()) {
        float gaugeV = bq27220BatteryVoltageVolts();
        if (gaugeV >= 0.0f) {
            return gaugeV;
        }
    }
    if (globalConfig.power_option.battery_sense_pin == 0xFF) return -1.0;
    uint8_t sensePin = globalConfig.power_option.battery_sense_pin;
    uint8_t enablePin = globalConfig.power_option.battery_sense_enable_pin;
    uint16_t scalingFactor = globalConfig.power_option.voltage_scaling_factor;
    pinMode(sensePin, INPUT);
    if (enablePin != 0xFF) {
        pinMode(enablePin, OUTPUT);
        digitalWrite(enablePin, HIGH);
        delay(10);
    }
    const int numSamples = 10;
    uint32_t adcSum = 0;
    for (int i = 0; i < numSamples; i++) {
        adcSum += analogRead(sensePin);
        delay(2);
    }
    uint32_t adcAverage = adcSum / numSamples;
    if (enablePin != 0xFF) {
        digitalWrite(enablePin, LOW);
    }
    if (scalingFactor > 0) return (adcAverage * scalingFactor) / (100000.0);
    return -1.0;
}

static constexpr uint32_t kBatteryVoltageTtlMs = 30000u;
float readBatteryVoltage() {
    static uint32_t lastReadMs = 0;
    static float cachedVoltage = -1.0f;
    static bool haveReading = false;
    if (haveReading && (uint32_t)(millis() - lastReadMs) < kBatteryVoltageTtlMs) {
        return cachedVoltage;
    }
    cachedVoltage = readBatteryVoltageUncached();
    lastReadMs = millis();
    haveReading = true;
    return cachedVoltage;
}

float readChipTemperature() {
#ifdef TARGET_ESP32
    return temperatureRead();
#elif defined(TARGET_NRF)
    int32_t tempRaw = 0;
    uint32_t err_code = sd_temp_get(&tempRaw);
    if (err_code == 0) return tempRaw * 0.25f;
    return -999.0;
#else
    return -999.0;
#endif
}

