davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
// Consume one compressed direct-write payload into the panel controller. Returns
// false on overflow guard or decompress/write failure; the CALLER owns cleanup and
// ACK/NACK emission (legacy 0x71 caller keeps its byte-identical acks; PIPE reuses
// the bool core without acking per frame). Does NOT advance directWriteCompressedReceived.
bool handleDirectWriteCompressedData(uint8_t* data, uint16_t len) {
    if (len > UINT32_MAX - directWriteCompressedReceived) {
        return false;
    }
    if (!zlib_stream_to_direct_write(data, len, false)) {
        return false;
    }
    return true;
}

// True when the active display uses the bb_epaper 4-gray scheme (two 1-bit
// controller planes). The FastEPD IT8951 path has its own 4bpp handling.
static inline bool directWriteIsGray4(void) {
    return (globalConfig.displays[0].color_scheme == OD_COLOR_SCHEME_GRAY4)
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
        && !fastepd_driver_used()
#endif
        ;
}

// Two-plane uploads (4-gray and BWR/BWY) arrive as two pre-split, row-padded 1-bit
// controller planes concatenated (plane0 then plane1). 4-gray is already gray-coded
// host-side (py-opendisplay applies the panel's gray LUT, matching bbepSetPixel4Gray:
// plane0 <- stored bit0, plane1 <- stored bit1); BWR/BWY send plane0 = BW (palette
// index 1) then plane1 = accent (index 2). Both share the identical byte layout, so
// stream the bytes to the panel, switching from PLANE_0 to PLANE_1 at the single-plane
// boundary - no on-device de-interleave or 2bpp frame buffer. directWriteBytesWritten
// is the running total across both planes, so the compressed and uncompressed paths
// share this one plane-split implementation.
static void streamGray4Bytes(const uint8_t* buf, uint32_t len) {
    const uint32_t planeBytes = (((uint32_t)directWriteWidth + 7u) / 8u) * directWriteHeight;
    uint32_t off = 0;
    while (off < len && directWriteBytesWritten < 2u * planeBytes) {
        if (directWriteBytesWritten == 0u) {
            bbepSetAddrWindow(&bbep, 0, 0, directWriteWidth, directWriteHeight);
            bbepStartWrite(&bbep, PLANE_0);
        } else if (directWriteBytesWritten == planeBytes) {
            bbepSetAddrWindow(&bbep, 0, 0, directWriteWidth, directWriteHeight);
            bbepStartWrite(&bbep, PLANE_1);
        }
        const uint32_t limit = (directWriteBytesWritten < planeBytes) ? planeBytes : 2u * planeBytes;
        uint32_t take = len - off;
        if (directWriteBytesWritten + take > limit) take = limit - directWriteBytesWritten;
        bbepWriteData(&bbep, (uint8_t*)(buf + off), (int)take);
        off += take;
        directWriteBytesWritten += take;
    }
}

static void directWriteSinkBytes(uint8_t* data, uint32_t len) {
#ifdef BBEP_T133A01
    if (e1004_panel_used()) {
        if (e1004GeometryOk) e1004_sink_bytes(data, len);
    } else
#endif
    {
        bbepWriteData(&bbep, data, (int)len);
    }
    directWriteBytesWritten += len;
}

static bool directWriteTouchSuspended = false;

void cleanupDirectWriteState(bool refreshDisplay) {
    directWriteActive = false;
    directWriteCompressed = false;
    directWriteBitplanes = false;
    directWritePlane2 = false;
    directWriteBytesWritten = 0;
    directWriteCompressedReceived = 0;
    directWriteDecompressedTotal = 0;
    directWriteWidth = 0;
    directWriteHeight = 0;
    directWriteTotalBytes = 0;
    directWriteRefreshMode = 0;
    directWriteStartTime = 0;
    // Panel power acts only while a transfer/refresh is actually in flight
    // (PWR_ACTIVE). refreshDisplay==true is a terminal teardown (disconnect,
    // 15-min timeout, mid-stream error) -> power fully off. refreshDisplay==false
    // is the post-refresh path from directWriteFinishAndRefresh -> release to WARM
    // so keep-alive holds the rail for the next push.
    if (pwrmgmState == PWR_ACTIVE) {
        if (refreshDisplay) epdSessionForceOff();
        else                epdSessionRelease(true);
    }
#ifdef BBEP_T133A01
    if (e1004_panel_used()) e1004_end_plane();
#endif
    if (directWriteTouchSuspended) {
        touchResumeAfterEpdRefresh();
        directWriteTouchSuspended = false;
    }
}

// Computes the panel geometry and total controller byte count for a direct-write
// session and records the compressed flag. Sets directWrite{Compressed,Bitplanes,
// Plane2,Width,Height,TotalBytes}. No panel I/O, no acks. Shared by 0x70 and 0x80.
static void directWriteComputeGeometry(bool compressed) {
    uint8_t colorScheme = globalConfig.displays[0].color_scheme;
    directWriteBitplanes = (colorScheme == OD_COLOR_SCHEME_BWR || colorScheme == OD_COLOR_SCHEME_BWY);
    directWritePlane2 = false;
    directWriteCompressed = compressed;
    directWriteWidth = globalConfig.displays[0].pixel_width;
    directWriteHeight = globalConfig.displays[0].pixel_height;
    if (directWriteBitplanes) directWriteTotalBytes = 2u * (((uint32_t)directWriteWidth + 7u) / 8u) * directWriteHeight;
    else {
        // Panel RAM is row-padded: each row occupies ceil(w / pixelsPerByte) bytes, and the
        // Python sender row-pads every plane (np.packbits(axis=1)). Size FLAT and we under-count
        // on width-not-divisible-by-8 panels (e.g. 122-wide EP213), auto-completing before the
        // bottom rows are written. Size row-padded to match sender + the gray4/bitplane paths.
        uint32_t w = (uint32_t)directWriteWidth;
        uint32_t h = (uint32_t)directWriteHeight;
        int bitsPerPixel = getBitsPerPixel();
        if (bitsPerPixel == 4) directWriteTotalBytes = ((w + 1u) / 2u) * h;       // ceil(w/2) bytes/row
        else if (bitsPerPixel == 2) directWriteTotalBytes = ((w + 3u) / 4u) * h;  // ceil(w/4) bytes/row
        else directWriteTotalBytes = calc_controller_plane_bytes(directWriteWidth, directWriteHeight); // ceil(w/8) bytes/row
    }
    // 4-gray arrives as two concatenated 1bpp planes (plane0 ++ plane1), streamed to
    // PLANE_0/PLANE_1. Both compressed and uncompressed transports feed bytes through
    // streamGray4Bytes as chunks arrive.
    const bool gray4 = directWriteIsGray4();
    if (gray4) directWriteTotalBytes = 2u * (((uint32_t)directWriteWidth + 7u) / 8u) * directWriteHeight;
}

