davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
// Powers/initializes the panel, opens the full address window, and (compressed)
// resets the zlib streamer. directWriteDecompressedTotal must already be set for
// compressed. Shared by 0x70 and 0x80. No header parsing, no inline data, no acks.
static void directWriteActivatePanel(void) {
    directWriteActive = true;
    directWriteBytesWritten = 0;
    directWriteStartTime = millis();
    imageWriteLogStart(directWriteTotalBytes);
    // Full-frame write: acquire the session with the FULL init sequence. A warm
    // re-acquire skips the ~900 ms rail bring-up + bbepInitIO (replaces the old
    // force power-cycle, which under keep-alive would fire on every push). A
    // full-frame direct write does not preserve partial plane consistency.
    epdSessionAcquire(false);
    epdPlanesPrepared = false;
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        fastepd_direct_write_reset();
    } else
#endif
#ifdef BBEP_T133A01
    if (e1004_panel_used()) {
        if (!e1004_begin_plane()) {
            od_log_error("ERROR: E1004 dual-CS plane open failed");
        }
    } else
#endif
    {
        bbepSetAddrWindow(&bbep, 0, 0, globalConfig.displays[0].pixel_width, globalConfig.displays[0].pixel_height);
        bbepStartWrite(&bbep, directWriteBitplanes ? PLANE_0 : getplane());
    }
    if (directWriteCompressed) {
        od_zlib_stream_reset(directWriteDecompressedTotal);
    }
}

// ------------------------------------------------------- session ownership ---
// Transfer state (directWriteActive, the zlib window, pipeState, partialCtx, panel
// power) is a single global set, while g_commandOrigin is per-FRAME. Without an
// owner recorded at START, a frame from the other transport joins the in-flight
// session -- feeding a BLE chunk into a LAN transfer's zlib stream corrupts it
// silently, and its ack goes back to the injector rather than the owning client.
// The same gap lets a BLE disconnect tear down a live LAN transfer (see
// transferSessionOrigin() use in main.cpp's serviceBleDisconnectCleanup).
static uint8_t sessionOrigin = 0;   // ORIGIN_BLE

uint8_t transferSessionOrigin(void) { return sessionOrigin; }

// True when the frame being dispatched belongs to the transport that opened the
// session. Logs once per rejected frame: silent discard is what made this class of
// corruption invisible in the first place.
static bool frameOwnsSession(const char* what) {
    if (commandOrigin() == sessionOrigin) return true;
    od_log_warn("WARNING: %s frame from origin %d dropped; session owned by origin %d",
                what, (int)commandOrigin(), (int)sessionOrigin);
    return false;
}

void handleDirectWriteStart(uint8_t* data, uint16_t len) {
    sessionOrigin = commandOrigin();
    if (partialCtx.active) cleanup_partial_write_state();
    if (directWriteActive) {
        cleanupDirectWriteState(false);
    }
    resetPipeWriteState();
    imageWriteLogReset();
    touchSuspendForEpdRefresh();
    directWriteTouchSuspended = true;
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        fastepd_prepare_hardware();
    }
#endif
    bool compressed = (len >= 4);
    directWriteComputeGeometry(compressed);
    if (compressed) {
        memcpy(&directWriteDecompressedTotal, data, 4);
        if (directWriteDecompressedTotal != directWriteTotalBytes) {
            cleanupDirectWriteState(false);
            uint8_t errorResponse[] = {RESP_NACK, RESP_DIRECT_WRITE_START_ACK};
            sendResponse(errorResponse, sizeof(errorResponse));
            return;
        }
    }
    directWriteActivatePanel();
    if (compressed && len > 4) {
        uint32_t compressedDataLen = len - 4;
        if (!zlib_stream_to_direct_write(data + 4, compressedDataLen, false)) {
            cleanupDirectWriteState(false);
            uint8_t errorResponse[] = {RESP_NACK, RESP_DIRECT_WRITE_START_ACK};
            sendResponse(errorResponse, sizeof(errorResponse));
            return;
        }
        directWriteCompressedReceived = compressedDataLen;
    }
    uint8_t ackResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_START_ACK};
    sendResponse(ackResponse, sizeof(ackResponse));
}

void handlePartialWriteStart(uint8_t* data, uint16_t len) {
    sessionOrigin = commandOrigin();
    if (directWriteActive) cleanupDirectWriteState(false);
    if (partialCtx.active) cleanup_partial_write_state();
    resetPipeWriteState();
    imageWriteLogReset();

    if (len < sizeof(struct PartialWriteStartHeader)) {
        send_direct_write_nack(0x76, OD_ERR_PARTIAL_STREAM, false);
        return;
    }

    // Layout is struct PartialWriteStartHeader (17 B). It is ALL big-endian, unlike
    // the little-endian PipePartialExt twin, so we parse by hand (the shifts ARE the
    // byte-swap) rather than overlaying the struct on this LE MCU.
    uint8_t flags     = data[0];
    uint32_t oldEtag  = parse_be_u32(data + 1);
    uint32_t newEtag  = parse_be_u32(data + 5);
    uint16_t rectX    = ((uint16_t)data[9]  << 8) | data[10];
    uint16_t rectY    = ((uint16_t)data[11] << 8) | data[12];
    uint16_t rectW    = ((uint16_t)data[13] << 8) | data[14];
    uint16_t rectH    = ((uint16_t)data[15] << 8) | data[16];

    if ((flags & ~PARTIAL_ALLOWED_FLAGS) != 0) {
        send_direct_write_nack(0x76, OD_ERR_PARTIAL_FLAGS, false);
        return;
    }

    if (oldEtag == 0 || oldEtag != displayed_etag || newEtag == 0) {
        send_direct_write_nack(0x76, OD_ERR_PARTIAL_ETAG_MISMATCH, false);
        return;
    }

    uint16_t dispW = globalConfig.displays[0].pixel_width;
    uint16_t dispH = globalConfig.displays[0].pixel_height;
    if (getBitsPerPixel() != 1 || e1004_panel_used()) {
        // bb_epaper partial refresh support is effectively non-existent for
        // 2bpp+ panels, and physical panels may not support that mode either.
        // This protocol uses two 1bpp controller planes as old/new image memory.
        send_direct_write_nack(0x76, OD_ERR_PARTIAL_UNSUPPORTED, false);
        return;
    }

    if (rectW == 0 || rectH == 0 ||
        (uint32_t)rectX + rectW > dispW ||
        (uint32_t)rectY + rectH > dispH) {
        send_direct_write_nack(0x76, OD_ERR_PARTIAL_RECT_OOB, false);
        return;
    }

    if ((rectX & 7u) != 0 || (rectW & 7u) != 0) {
        send_direct_write_nack(0x76, OD_ERR_PARTIAL_RECT_ALIGN, false);
        return;
    }

