davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
    // Respond BEFORE panel bring-up: slow panels (Spectra/ACeP-class init can take
    // seconds) must not starve the client's 0x0080 START wait. Clients gate pipe
    // attempts on the config pipe bit and wait a normal command timeout (30 s,
    // sized for the ESP32 response-queue flush landing after bring-up), but
    // responding first keeps the wait short on nRF and any direct-notify path.
    // Ordering is safe on both targets: on ESP32 this handler runs in the main-loop
    // queue drain, so 0x0081 frames arriving during bring-up park in the 33-slot
    // ingest ring until we return; on nRF the Bluefruit write callback dispatches
    // commands sequentially from its callback task, so activation below completes
    // before any queued 0x0081 write is handed to the dispatcher.
    // Device maxima; flags bit0 SET (selective repeat), bit1 = partial accepted (plan 1.2).
    // TODO(protocol): 0x80 has no RESP_* mirror (see sendPipeAck), and the START
    // response-flags bit0 "selective repeat" has no canonical constant (distinct from
    // the request-side PIPE_FLAG_*). Add RESP_PIPE_WRITE_START + a response-flag
    // constant upstream, then replace the raw 0x80 / 0x01 here.
    uint8_t resp[8] = {RESP_ACK, 0x80, PIPE_VERSION, PIPE_MAX_W, PIPE_MAX_N,
                       (uint8_t)(PIPE_MAX_FRAME & 0xFF), (uint8_t)((PIPE_MAX_FRAME >> 8) & 0xFF),
                       (uint8_t)(0x01 | (partial ? PIPE_FLAG_PARTIAL : 0))};
    sendResponse(resp, sizeof(resp));

    if (partial) {
        // Partial bring-up (0x76 parity): white-fill both controller planes and reset the
        // zlib stream if compressed. Deliberately NOT the full-frame path — do not suspend
        // touch, set directWriteActive, or call directWriteActivatePanel (partial_write_to_panel
        // powers the panel down on the 0x0082 END; partial_prepare_panel_ram brought it up).
        imageWriteLogReset();
        imageWriteLogStart(total_size);
        partial_prepare_panel_ram();
        if (compressed) od_zlib_stream_reset(total_size);
        return;
    }

    // Bring up the full-frame session exactly like legacy START (touch suspend, panel prep).
    imageWriteLogReset();
    touchSuspendForEpdRefresh();
    directWriteTouchSuspended = true;
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        fastepd_prepare_hardware();
    }
#endif
    directWriteDecompressedTotal = total_size;   // compressed zlib reset + overflow guard
    directWriteActivatePanel();
}

void handlePipeWriteData(uint8_t* data, uint16_t len) {
    if (!pipeState.active || pipeState.error) return;   // silent discard
    if (len < 1) return;
    if (!frameOwnsSession("0x0081")) return;
    uint8_t  seq     = data[0];
    uint8_t* payload = data + 1;
    uint16_t plen    = (uint16_t)(len - 1);
    if (plen > PIPE_REORDER_SLOT_SIZE) { sendPipeNack(0x03); return; }  // over-size frame (impossible <=244)

    const uint8_t W   = pipeState.window;
    uint8_t fwd  = (uint8_t)(seq - pipeState.expected_seq);   // 0 in-order; 1..W-1 ahead
    uint8_t back = (uint8_t)(pipeState.expected_seq - seq);   // >=1 below expected

    if (fwd == 0) {
        // In-order accept -> stream to controller, then drain contiguous successors.
        // Count every accepted frame (trigger + drained) toward the ACK cadence so a
        // post-gap drain refunds tokens promptly instead of waiting for fresh frames.
        if (!pipeConsumePayload(payload, plen)) { sendPipeNack(pipeState.compressed ? 0x02 : 0x03); return; }
        pipeState.expected_seq++;
        pipeState.received_count++;
        pipeState.frames_since_ack++;
        pipeUpdateHighestSeen(seq);
        while (pipeReorder[pipeSlot(pipeState.expected_seq)].occupied &&
               pipeReorder[pipeSlot(pipeState.expected_seq)].seq == pipeState.expected_seq) {
            PipeReorderSlot& s = pipeReorder[pipeSlot(pipeState.expected_seq)];
            if (!pipeConsumePayload(s.data, s.len)) { sendPipeNack(pipeState.compressed ? 0x02 : 0x03); return; }
            s.occupied = false;
            if (pipeState.queued_count > 0) pipeState.queued_count--;
            pipeState.expected_seq++;
            pipeState.received_count++;
            if (pipeState.frames_since_ack < 0xFF) pipeState.frames_since_ack++;
        }
        if (pipeState.queued_count == 0) pipeState.gap_open = false;
        // Auto-complete (uncompressed FULL-FRAME only, mirrors legacy handleDirectWriteData
        // auto-finish). The shared helper emits the single unsolicited {0x00,0x82} END ack then
        // refreshes with a FULL waveform. MUST be gated on !partial: a partial transfer never
        // touches directWrite* (both are 0), so 0>=0 would false-fire a FULL refresh on the very
        // first frame — partial transfers complete only on the explicit 0x0082 END (plan 1.5).
        if (!pipeState.partial && !pipeState.compressed && directWriteBytesWritten >= directWriteTotalBytes) {
            sendPipeAck();                                   // final tail flush ({0x00,0x81})
            directWriteFinishAndRefresh(nullptr, 0, 0x82);   // {0x00,0x82} + FULL refresh, no etag
            resetPipeWriteState();
            return;
        }
        if (pipeState.frames_since_ack >= pipeState.ack_every) sendPipeAck();
        return;
    }

    if (fwd < W) {
        // Ahead within the window -> PAUSE POINT: hold in the reorder queue, nothing
        // reaches the controller past the hole.
        PipeReorderSlot& s = pipeReorder[pipeSlot(seq)];
        bool duplicate = (s.occupied && s.seq == seq);
        s.occupied = true;
        s.seq = seq;
        s.len = plen;
        memcpy(s.data, payload, plen);
        if (!duplicate) {
            pipeState.queued_count++;
            if (pipeState.queued_count > pipeState.queue_high_water)
                pipeState.queue_high_water = pipeState.queued_count;
        }
        if (pipeState.queued_count >= PIPE_REORDER_SLOTS) { sendPipeNack(0x03); return; }  // overflow guard
        pipeUpdateHighestSeen(seq);
        // Gap ACK: immediately when the gap first opens (fast-retransmit), then
        // rate-limited to one per ack_every subsequent out-of-order arrivals.
        if (!pipeState.gap_open) {
            pipeState.gap_open = true;
            sendPipeAck();                                   // resets ooo_acks_since_gap to 0
        } else if (++pipeState.ooo_acks_since_gap >= pipeState.ack_every) {
            sendPipeAck();
        }
        return;
    }

    // fwd >= W: either a duplicate of an already-accepted chunk (seq just below
    // expected) or a genuinely out-of-window frame.
    if (back <= W) {
        // Duplicate/below-expected -> discard, ACK so the sender learns our position
        // (rate-limited the same way as out-of-order arrivals).
        if (!pipeState.gap_open) {
            sendPipeAck();
        } else if (++pipeState.ooo_acks_since_gap >= pipeState.ack_every) {
            sendPipeAck();
        }
        return;
    }

    // Out of window on both sides -> protocol violation.
    sendPipeNack(0x04);
}

