davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
void handlePipeWriteEnd(uint8_t* data, uint16_t len) {
    if (pipeState.active && !frameOwnsSession("0x0082")) return;
    if (!pipeState.active) {
        uint8_t n[2] = {RESP_NACK, 0x82};   // no active pipe transfer
        sendResponse(n, sizeof(n));
        return;
    }
    if (pipeState.error) {
        uint8_t n[2] = {RESP_NACK, 0x82};   // a fatal error already NACKed this transfer
        sendResponse(n, sizeof(n));
        // sendPipeNack already released the panel hardware at NACK time; this
        // re-run is a defensive no-op (partialCtx / directWriteActive already down).
        if (pipeState.partial) cleanup_partial_write_state();
        else cleanupDirectWriteState(false);
        resetPipeWriteState();
        return;
    }
    // Tail-flush ACK precedes the END result (plan 1.3c / 1.5).
    sendPipeAck();

    // Partial transfers never auto-complete (plan 1.5): the 0x0082 END alone carries the
    // refresh mode + new_etag. Completeness mirrors the 0x76 partial branch.
    if (pipeState.partial) {
        bool incomplete = (pipeState.queued_count > 0);
        if (partialCtx.compressed) {
            if (partialCtx.bytes_received == 0 || !zlib_stream_to_partial_write(nullptr, 0, true)) incomplete = true;
        } else if (partialCtx.bytes_written != partialCtx.expected_stream_size) {
            incomplete = true;
        }
        if (incomplete) {
            uint8_t n[2] = {RESP_NACK, 0x82};
            sendResponse(n, sizeof(n));
            displayed_etag = 0;
            cleanup_partial_write_state();
            resetPipeWriteState();
            return;
        }
        imageWriteLogFinish(partialCtx.bytes_received, partialCtx.expected_stream_size);
        uint8_t ackResponse[] = {RESP_ACK, 0x82};
        sendResponse(ackResponse, sizeof(ackResponse));
        // Refresh selector rides the END tail (plan 1.4): 0->FULL, 1->FAST, 2/absent->PARTIAL.
        int refreshMode = REFRESH_PARTIAL;
        if (data != nullptr && len >= 1 && data[0] == REFRESH_FULL) refreshMode = REFRESH_FULL;
        else if (data != nullptr && len >= 1 && data[0] == REFRESH_FAST) refreshMode = REFRESH_FAST;
        // new_etag rides the END tail [refresh:1][new_etag:4 BE]; absent => 0.
        uint32_t newEtag = (len >= 5) ? parse_be_u32(data + 1) : 0;
        bool refreshSuccess = partial_write_to_panel(refreshMode);
        if (refreshSuccess) {
            displayed_etag = newEtag;
            uint8_t validatedResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_REFRESH_SUCCESS};
            sendResponse(validatedResponse, sizeof(validatedResponse));
        } else {
            displayed_etag = 0;
            uint8_t timeoutResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_REFRESH_TIMEOUT};
            sendResponse(timeoutResponse, sizeof(timeoutResponse));
        }
        cleanup_partial_write_state();
        resetPipeWriteState();
        return;
    }

    // The client must not send END before every chunk is acked; a hole or short
    // byte count here is a protocol violation.
    bool incomplete = (pipeState.queued_count > 0);
    if (!pipeState.compressed && directWriteBytesWritten < directWriteTotalBytes) incomplete = true;
    if (incomplete) {
        uint8_t n[2] = {RESP_NACK, 0x82};
        sendResponse(n, sizeof(n));
        // Mid-stream abort with the panel powered: use the legacy mid-stream
        // variant (refreshDisplay=true → sleep the controller cleanly, cut power,
        // resume touch), matching the legacy {0xFF,0x71}/zlib-flush failure paths.
        cleanupDirectWriteState(true);
        resetPipeWriteState();
        return;
    }
    // Shared END/refresh flow emits {0x00,0x82} then {0x00,0x73}/{0x00,0x74}.
    // Compressed incompleteness surfaces as a zlib-flush NACK {0xFF,0x82} inside.
    directWriteFinishAndRefresh(data, len, 0x82);
    resetPipeWriteState();
}

static void cleanup_partial_write_state(void) {
    // Tear the panel down only when a transfer/refresh is actually in flight
    // (PWR_ACTIVE) — i.e. on error / NACK / disconnect-mid-stream / watchdog. After
    // a successful refresh, epdSessionRelease already moved to PWR_WARM, so
    // post-success cleanups become bookkeeping-only and leave keep-alive running.
    bool teardown = partialCtx.active && pwrmgmState == PWR_ACTIVE;
    memset(&partialCtx, 0, sizeof(partialCtx));
    if (teardown) epdSessionForceOff();
}

static bool panel_skips_bbep_set_addr_window(void) {
    return bbep.type == EP397_800x480 || bbep.type == EP397_800x480_4GRAY ||
           bbep.type == EP426_800x480 || bbep.type == EP426_800x480_4GRAY;
}

static bool panel_uses_pixel_ram_x(BBEPDISP *pBBEP) {
    return pBBEP->type == EP397_800x480 || pBBEP->type == EP397_800x480_4GRAY ||
           pBBEP->type == EP426_800x480 || pBBEP->type == EP426_800x480_4GRAY;
}

static bool panel_uses_ep397_y_decrement(BBEPDISP *pBBEP) {
    return pBBEP->type == EP397_800x480 || pBBEP->type == EP397_800x480_4GRAY;
}

static bool panel_uses_ep426_x_decrement(BBEPDISP *pBBEP) {
    return pBBEP->type == EP426_800x480 || pBBEP->type == EP426_800x480_4GRAY;
}

static bool panel_skips_reinit_on_partial_refresh(BBEPDISP *pBBEP) {
    return panel_uses_ep397_y_decrement(pBBEP) || panel_uses_ep426_x_decrement(pBBEP);
}

static void partial_set_ep397_ram_y(BBEPDISP *pBBEP, int ty, int cy) {
    uint8_t uc[4];
    int yLast = ty + cy - 1;
    int ramYStart = (pBBEP->native_height - 1) - ty;
    int ramYEnd = (pBBEP->native_height - 1) - yLast;

    bbepWriteCmd(pBBEP, SSD1608_SET_RAMYPOS);
    uc[0] = (uint8_t)(ramYStart & 0xff);
    uc[1] = (uint8_t)(ramYStart >> 8);
    uc[2] = (uint8_t)(ramYEnd & 0xff);
    uc[3] = (uint8_t)(ramYEnd >> 8);
    bbepWriteData(pBBEP, uc, 4);

    bbepWriteCmd(pBBEP, SSD1608_SET_RAMYCOUNT);
    uc[0] = (uint8_t)(ramYStart & 0xff);
    uc[1] = (uint8_t)(ramYStart >> 8);
    bbepWriteData(pBBEP, uc, 2);
}

static void partial_set_ep426_ram_y(BBEPDISP *pBBEP, int ty, int cy) {
    uint8_t uc[4];
    int yLast = ty + cy - 1;

    // Match epd426_init_* 0x45 wire order: Y start in bytes 0-1, Y end in bytes 2-3.
    bbepWriteCmd(pBBEP, SSD1608_SET_RAMYPOS);
    uc[0] = (uint8_t)ty;
    uc[1] = (uint8_t)(ty >> 8);
    uc[2] = (uint8_t)yLast;
    uc[3] = (uint8_t)(yLast >> 8);
    bbepWriteData(pBBEP, uc, 4);

    bbepWriteCmd(pBBEP, SSD1608_SET_RAMYCOUNT);
    uc[0] = (uint8_t)ty;
    uc[1] = (uint8_t)(ty >> 8);
    bbepWriteData(pBBEP, uc, 2);
}

static void partial_set_pixel_ram_x(BBEPDISP *pBBEP, int x, int cx) {
    uint8_t uc[4];
    int px0 = x;
    int px1 = x + cx - 1;
    if (panel_uses_ep426_x_decrement(pBBEP)) {
        px0 = (pBBEP->native_width - 1) - x;
        px1 = (pBBEP->native_width - 1) - (x + cx - 1);
    }

    bbepWriteCmd(pBBEP, SSD1608_SET_RAMXPOS);
    uc[0] = (uint8_t)(px0 & 0xff);
    uc[1] = (uint8_t)((px0 >> 8) & 0xff);
    uc[2] = (uint8_t)(px1 & 0xff);
    uc[3] = (uint8_t)(px1 >> 8);
    bbepWriteData(pBBEP, uc, 4);

    bbepWriteCmd(pBBEP, SSD1608_SET_RAMXCOUNT);
    uc[0] = (uint8_t)(px0 & 0xff);
    uc[1] = (uint8_t)(px0 >> 8);
    bbepWriteData(pBBEP, uc, 2);
}

static void partial_set_addr_window(BBEPDISP *pBBEP, int x, int y, int cx, int cy) {
    if (!panel_skips_bbep_set_addr_window()) {
        bbepSetAddrWindow(pBBEP, x, y, cx, cy);
        return;
    }
    if (!pBBEP) return;

    uint8_t uc[4];
    int ty = y;
    cx = (cx + 7) & 0xfff8;

